tap "1password/tap"
tap "getsentry/tools"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/command-not-found"
tap "homebrew/services"
brew "act"
brew "aespipe"
brew "yamllint"
brew "ansible-lint"
brew "giflib"
brew "libpng"
brew "asciinema"
brew "autoconf"
brew "automake"
brew "gmp"
brew "asdf"
brew "bash"
brew "bat"
brew "bison"
brew "freetype"
brew "gettext"
brew "pixman"
brew "cairo"
brew "diff-so-fancy"
brew "diffstat"
brew "direnv"
brew "doggo"
brew "entr"
brew "eza"
brew "fd"
brew "icu4c"
brew "libsodium"
brew "pango"
brew "ffmpeg"
brew "flake8"
brew "gd"
brew "geos"
brew "gnupg"
brew "krb5"
brew "libxml2"
brew "openblas"
brew "numpy"
brew "gdal"
brew "geckodriver"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "gnu-sed"
brew "httpie"
brew "imagemagick"
brew "infracost"
brew "jpeg"
brew "jq"
brew "libedit"
brew "libiconv"
brew "libzip"
brew "mas"
brew "mkcert"
brew "mkdocs"
brew "zlib"
brew "mysql"
brew "nano"
brew "neovim"
brew "openjdk"
brew "openssh"
brew "openssl@1.1"
brew "pandoc"
brew "php-code-sniffer"
brew "pigz"
brew "pinentry-mac"
brew "pkg-config"
brew "postgresql@15"
brew "pre-commit"
brew "pwgen"
brew "python@3.10"
brew "re2c"
brew "ripgrep-all"
brew "rlwrap"
brew "semgrep"
brew "sqlfluff"
brew "starship"
brew "steampipe"
brew "tflint"
brew "tldr"
brew "watch"
brew "wget"
brew "zoxide"
brew "getsentry/tools/sentry-cli"
cask "1password"
cask "1password-cli"
cask "alfred"
cask "balenaetcher"
cask "bartender"
cask "basecamp"
cask "bettertouchtool"
cask "dash"
cask "datagrip"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-montserrat"
cask "github"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "keyboardcleantool"
cask "miro"
cask "monodraw"
cask "ngrok"
cask "notion"
cask "numi"
cask "parallels"
cask "parsec"
cask "powershell"
cask "qlmarkdown"
cask "qlstephen"
cask "redisinsight"
cask "remotion"
cask "shifty"
cask "switchresx"
cask "syntax-highlight"
cask "teamviewer"
cask "ticktick"
cask "vagrant"
cask "visual-studio-code"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Cardhop", id: 1290358394
mas "Dark Mode for Safari", id: 1397180934
mas "Developer", id: 640199958
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Gifski", id: 1351639930
mas "Hush", id: 1544743900
mas "iMovie", id: 408981434
mas "iStat Menus", id: 1319778037
mas "Jiffy", id: 1502527999
mas "Kagi Inc.", id: 1622835804
mas "Keynote", id: 409183694
mas "Meeter", id: 1510445899
mas "Numbers", id: 409203825
mas "OpenIn", id: 1643649331
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Reeder", id: 1529448980
mas "Shareful", id: 1522267256
mas "Shazam", id: 897118787
mas "Slack", id: 803453959
mas "Spark Desktop", id: 6445813049
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "Trello", id: 1278508951
mas "Triode", id: 1450027401
mas "Twitter", id: 1482454543
mas "Unsplash Wallpapers", id: 1284863847
mas "Wipr", id: 1320666476
mas "Xcode", id: 497799835
vscode "1Password.op-vscode"
vscode "alefragnani.project-manager"
vscode "alexkrechik.cucumberautocomplete"
vscode "bierner.markdown-mermaid"
vscode "bmarkovic.haproxy"
vscode "bradlc.vscode-tailwindcss"
vscode "burkeholland.simple-react-snippets"
vscode "chicoff.mapfile"
vscode "chrislajoie.vscode-modelines"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.ssh"
vscode "codezombiech.gitignore"
vscode "coolbear.systemd-unit-file"
vscode "darian-benam.vscode-robots-dot-txt-support"
vscode "dariofuzinato.vue-peek"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "deerawan.vscode-dash"
vscode "dorzey.vscode-sqlfluff"
vscode "eamodio.gitlens"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "GitHub.remotehub"
vscode "GitHub.vscode-codeql"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "googlecloudtools.cloudcode"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-execution"
vscode "GraphQL.vscode-graphql-syntax"
vscode "hashhar.gitattributes"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "heybourn.headwind"
vscode "hogashi.crontab-syntax-highlight"
vscode "humao.rest-client"
vscode "jasonnutter.vscode-codeowners"
vscode "jinliming2.vscode-go-template"
vscode "luggage66.AWK"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mongodb.mongodb-vscode"
vscode "mrmlnc.vscode-apache"
vscode "mrmlnc.vscode-scss"
vscode "mrorz.language-gettext"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msysyamamoto.vscode-fluentd"
vscode "mxschmitt.postscript"
vscode "neilbrayfield.php-docblocker"
vscode "Oracle.oracledevtools"
vscode "Orta.vscode-jest"
vscode "ParallelsDesktop.parallels-desktop"
vscode "pflannery.vscode-versionlens"
vscode "philnash.ngrok-for-vscode"
vscode "redhat.ansible"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "samuelcolvin.jinjahtml"
vscode "sdras.vue-vscode-snippets"
vscode "seatonjiang.gitmoji-vscode"
vscode "SonarSource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-dutch"
vscode "styled-components.vscode-styled-components"
vscode "stylelint.vscode-stylelint"
vscode "systemticks.c4-dsl-extension"
vscode "TedisAgolli.hex-to-tailwind"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "Vue.volar"
vscode "webben.browserslist"
vscode "whatwedo.twig"
vscode "wholroyd.jinja"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "xdebug.php-debug"
vscode "yoavbls.pretty-ts-errors"
vscode "yy0931.save-as-root"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
