1password.op-vscode
biomejs.biome
davidanson.vscode-markdownlint
dracula-theme-pro.theme-dracula-pro
esbenp.prettier-vscode
github.codespaces
github.copilot
github.copilot-chat
github.vscode-codeql
github.vscode-github-actions
github.vscode-pull-request-github
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
redhat.vscode-yaml
upstash.context7-mcp
