# Manually generated with `code --list-extensions`

1password.op-vscode
biomejs.biome
charliermarsh.ruff
davidanson.vscode-markdownlint
docker.docker
github.codespaces
github.copilot
github.copilot-chat
github.vscode-codeql
github.vscode-github-actions
github.vscode-pull-request-github
irongeek.vscode-env
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
redhat.vscode-yaml
sidneys1.gitconfig
