# Manually generated with `code --list-extensions`

1password.op-vscode
castwide.solargraph
charliermarsh.ruff
coolbear.systemd-unit-file
davidanson.vscode-markdownlint
deerawan.vscode-dash
eamodio.gitlens
github.codespaces
github.copilot
github.copilot-chat
github.vscode-codeql
github.vscode-github-actions
github.vscode-pull-request-github
google.geminicodeassist
googlecloudtools.cloudcode
grafana.grafana-alloy
hashicorp.terraform
irongeek.vscode-env
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vsliveshare.vsliveshare
redhat.ansible
redhat.vscode-yaml
sidneys1.gitconfig
timonwong.shellcheck
twxs.cmake
william-voyek.vscode-nginx
