# Manually generated with `code --list-extensions`

1Password.op-vscode
alefragnani.project-manager
alexkrechik.cucumberautocomplete
bierner.markdown-mermaid
bmarkovic.haproxy
bradlc.vscode-tailwindcss
burkeholland.simple-react-snippets
chicoff.mapfile
chrislajoie.vscode-modelines
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
chrmarti.ssh
codezombiech.gitignore
coolbear.systemd-unit-file
darian-benam.vscode-robots-dot-txt-support
dariofuzinato.vue-peek
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
deerawan.vscode-dash
dorzey.vscode-sqlfluff
eamodio.gitlens
EditorConfig.EditorConfig
esbenp.prettier-vscode
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
GitHub.remotehub
GitHub.vscode-codeql
github.vscode-github-actions
GitHub.vscode-pull-request-github
googlecloudtools.cloudcode
GraphQL.vscode-graphql
GraphQL.vscode-graphql-execution
GraphQL.vscode-graphql-syntax
hashhar.gitattributes
hashicorp.hcl
hashicorp.terraform
hbenl.vscode-test-explorer
heybourn.headwind
hogashi.crontab-syntax-highlight
humao.rest-client
jasonnutter.vscode-codeowners
jinliming2.vscode-go-template
luggage66.AWK
mechatroner.rainbow-csv
mikestead.dotenv
mongodb.mongodb-vscode
mrmlnc.vscode-apache
mrmlnc.vscode-scss
mrorz.language-gettext
ms-azuretools.vscode-docker
ms-dotnettools.vscode-dotnet-runtime
ms-kubernetes-tools.vscode-kubernetes-tools
ms-playwright.playwright
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.azure-repos
ms-vscode.hexeditor
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.test-adapter-converter
ms-vsliveshare.vsliveshare
msysyamamoto.vscode-fluentd
mxschmitt.postscript
neilbrayfield.php-docblocker
Oracle.oracledevtools
Orta.vscode-jest
ParallelsDesktop.parallels-desktop
pflannery.vscode-versionlens
philnash.ngrok-for-vscode
redhat.ansible
redhat.java
redhat.vscode-commons
redhat.vscode-xml
redhat.vscode-yaml
samuelcolvin.jinjahtml
sdras.vue-vscode-snippets
seatonjiang.gitmoji-vscode
SonarSource.sonarlint-vscode
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-dutch
styled-components.vscode-styled-components
stylelint.vscode-stylelint
systemticks.c4-dsl-extension
TedisAgolli.hex-to-tailwind
timonwong.shellcheck
usernamehw.errorlens
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
Vue.volar
webben.browserslist
whatwedo.twig
wholroyd.jinja
william-voyek.vscode-nginx
wix.vscode-import-cost
xdebug.php-debug
yoavbls.pretty-ts-errors
yy0931.save-as-root
yzhang.markdown-all-in-one
zobo.php-intellisense
